<a href="https://colab.research.google.com/github/matthew-sessions/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/module1-join-and-reshape-data/LS_DS_121_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

_Lambda School Data Science_

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-08-12 21:51:05--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.237.101
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.237.101|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  14.8MB/s    in 48s

2019-08-12 21:51:54 (4.07 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [0]:
import pandas as pd

products = pd.read_csv('products.csv')
orders = pd.read_csv('orders.csv')
op = pd.read_csv('order_products__prior.csv')
ot = pd.read_csv('order_products__train.csv')

In [6]:
op.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [7]:
ot.head()

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [8]:
order_c  = pd.concat([op, ot])
order_c.shape

(33819106, 4)

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [9]:
##### YOUR CODE HERE #####
products.tail()


# I will need products, orders, and the orders_c dataframe

       product_id  ... department_id
49683       49684  ...             5
49684       49685  ...             1
49685       49686  ...             3
49686       49687  ...             8
49687       49688  ...            11

[5 rows x 4 columns]

In [10]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [11]:
order_c.tail()

         order_id  product_id  add_to_cart_order  reordered
1384612   3421063       14233                  3          1
1384613   3421063       35548                  4          1
1384614   3421070       35951                  1          1
1384615   3421070       16953                  2          1
1384616   3421070        4724                  3          1

In [0]:
items = products[(products['product_name'] == 'Banana') |(products['product_name'] == 'Bag of Organic Bananas') |(products['product_name'] == 'Organic Strawberries') |(products['product_name'] == 'Organic Baby Spinach') |(products['product_name'] == 'Organic Hass Avocado') |(products['product_name'] == 'Organic Avocado') |(products['product_name'] == 'Large Lemon') |(products['product_name'] == 'Strawberries') |(products['product_name'] == 'Limes') |(products['product_name'] == 'Organic Whole Milk')]


#Creating a dataframe with the top ten products. I did this so it would load faster and save RAM.

In [13]:
items.shape

(10, 4)

In [14]:
items_c = pd.merge(items,order_c[['order_id','product_id']])
items_c.head()
#combine the new items DF with order_c DF where the order_c DF has the same product_id as the items DF.

   product_id            product_name  aisle_id  department_id  order_id
0       13176  Bag of Organic Bananas        24              4         5
1       13176  Bag of Organic Bananas        24              4        27
2       13176  Bag of Organic Bananas        24              4        29
3       13176  Bag of Organic Bananas        24              4        32
4       13176  Bag of Organic Bananas        24              4        42

In [15]:
items_c.shape

(2418314, 5)

In [16]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [17]:
orders[orders['order_id'] == 5]

         order_id  user_id  ... order_hour_of_day  days_since_prior_order
2593373         5   156122  ...                16                     9.0

[1 rows x 7 columns]

In [0]:
all_orders = pd.merge(orders, items_c, on='order_id')

In [19]:
all_orders.shape

(2418314, 11)

In [20]:
all_orders.head()

   order_id  user_id eval_set  ...            product_name  aisle_id  department_id
0   2398795        1    prior  ...  Bag of Organic Bananas        24              4
1    431534        1    prior  ...  Bag of Organic Bananas        24              4
2   1187899        1    train  ...      Organic Whole Milk        84             16
3   2168274        2    prior  ...  Bag of Organic Bananas        24              4
4   2168274        2    prior  ...         Organic Avocado        24              4

[5 rows x 11 columns]

In [0]:
ten_count = all_orders['product_name'].unique()

#getting the same unique top ten list

In [22]:
len(all_orders[all_orders['product_name'] == 'Bag of Organic Bananas'])

394930

In [23]:
for i in ten_count:
  print(i+': '+ str(len(all_orders[all_orders['product_name'] == i])))

#printing the results

Bag of Organic Bananas: 394930
Organic Whole Milk: 142813
Organic Avocado: 184224
Strawberries: 149445
Banana: 491291
Organic Hass Avocado: 220877
Organic Baby Spinach: 251705
Organic Strawberries: 275577
Limes: 146660
Large Lemon: 160792

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

In [25]:
table2.head()

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [26]:
table2.reset_index()

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [27]:
tidy = table2.melt(id_vars='index',value_vars=['John Smith', 'Jane Doe','Mary Johnson'])

/usr/local/lib/python3.6/dist-packages/pandas/core/indexing.py:1494: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

In [28]:
tidy
#I don't fully understand this

   index      variable  value
0    NaN    John Smith    NaN
1    NaN    John Smith    2.0
2    NaN      Jane Doe   16.0
3    NaN      Jane Doe   11.0
4    NaN  Mary Johnson    3.0
5    NaN  Mary Johnson    1.0

In [0]:
flights = sns.load_dataset('flights')

In [30]:
##### YOUR CODE HERE #####
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [0]:
flights_piv = flights.pivot_table(index='year', columns='month',values='passengers')

In [32]:
flights_piv

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [33]:
##### YOUR CODE HERE #####

products.head()

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [0]:
item2 = pd.merge(products,order_c[['order_id','product_id']])

In [35]:
item2.head()

   product_id                product_name  aisle_id  department_id  order_id
0           1  Chocolate Sandwich Cookies        61             19      1107
1           1  Chocolate Sandwich Cookies        61             19      5319
2           1  Chocolate Sandwich Cookies        61             19      7540
3           1  Chocolate Sandwich Cookies        61             19      9228
4           1  Chocolate Sandwich Cookies        61             19      9273

In [36]:
items_c.head()

   product_id            product_name  aisle_id  department_id  order_id
0       13176  Bag of Organic Bananas        24              4         5
1       13176  Bag of Organic Bananas        24              4        27
2       13176  Bag of Organic Bananas        24              4        29
3       13176  Bag of Organic Bananas        24              4        32
4       13176  Bag of Organic Bananas        24              4        42

In [37]:
orders_all = pd.merge(item2, orders, on='order_id')
orders_all.head()

   product_id  ... days_since_prior_order
0           1  ...                    7.0
1         769  ...                    7.0
2        6184  ...                    7.0
3        8048  ...                    7.0
4        9007  ...                    7.0

[5 rows x 11 columns]

In [38]:
orders_all.shape

(33819106, 11)

In [0]:
values = orders_all.product_name.value_counts()

In [41]:
values

Banana                                                                     491291
Bag of Organic Bananas                                                     394930
Organic Strawberries                                                       275577
Organic Baby Spinach                                                       251705
Organic Hass Avocado                                                       220877
Organic Avocado                                                            184224
Large Lemon                                                                160792
Strawberries                                                               149445
Limes                                                                      146660
Organic Whole Milk                                                         142813
Organic Raspberries                                                        142603
Organic Yellow Onion                                                       117716
Organic Garlic                                                             113936
Organic Zucchini                                                           109412
Organic Blueberries                                                        105026
Cucumber Kirby                                                              99728
Organic Fuji Apple                                                          92889
Organic Lemon                                                               91251
Organic Grape Tomatoes                                                      88078
Apple Honeycrisp Organic                                                    87272
Seedless Red Grapes                                                         86748
Organic Cucumber                                                            85005
Honeycrisp Apple                                                            83320
Organic Baby Carrots                                                        80493
Sparkling Water Grapefruit                                                  79245
Organic Half & Half                                                         79006
Organic Large Extra Fancy Fuji Apple                                        78056
Yellow Onions                                                               76929
Organic Baby Arugula                                                        75752
Organic Gala Apples                                                         75655
                                                                            ...
Orange Flavored Ice Cubes                                                       1
Seasoned Southern Style Red Beans And Rice                                      1
Lowfat Cherry Lime Supernova Kefir Cultured Milk Smoothie                       1
Pure Peppermint Extract                                                         1
Miss Treated Conditioner                                                        1
Sweetart Jelly Beans                                                            1
Peachtree Schnapps                                                              1
Pumpkin Spice Almond Nog                                                        1
Bottle & Nipple Brush Set                                                       1
Natural Peanut Butter With Flaxseed                                             1
Chardonnay Carneros                                                             1
Bite Size Caramel Chocolates                                                    1
Blueberry Blast Fruit and Chia Seed Bar                                         1
Midnight Brownie Cookies                                                        1
Pure Performance Restorative Shampoo Chamomile & Honey                          1
Brut Prosecco                                                                   1
Organic Aleppo Pepper                                                           1
Super Nutrition Vanilla Shake                                                   1
Aged Parmesan Cheese Sticks                                                     1
Organic Ice Cream Birthday Cake                                                 1
Original Lager                                                                  1
Tangerine Melon Bubble Bath                                                     1
Drink Distinct All Natural Soda Pineapple Coconut & Nutmeg                      1
Sloppy Joe Sandwich Makers                                                      1
Ultra Sun Blossom Liquid 90 loads Fabric Enhancers                              1
Anjou Pear Hand Soap                                                            1
Flame Roasted Red Peppers Spreadable Cheese                                     1
1,000 Mg Vitamin C Tangerine Grapefruit Effervescent Powdered Drink Mix         1
Cabernet Sauvignon 2015                                                         1
Hennepin Farmhouse Ale                                                          1
Name: product_name, Length: 49685, dtype: int64

In [0]:
val_df = pd.DataFrame(values)

In [86]:
val_df.head()

                        product_name
Banana                        491291
Bag of Organic Bananas        394930
Organic Strawberries          275577
Organic Baby Spinach          251705
Organic Hass Avocado          220877

In [0]:
val_df.reset_index(inplace=True)
val_df.rename(columns={'index': 'food','product_name':'count'}, inplace=True)

In [54]:
val_df.head()

                     food   count
0                  Banana  491291
1  Bag of Organic Bananas  394930
2    Organic Strawberries  275577
3    Organic Baby Spinach  251705
4    Organic Hass Avocado  220877

In [60]:
def high(li):
  if li >= 2900:
    return(True)
  else:
    return(False)

val_df['rate'] = val_df['count'].apply(high)
val_df.head()

                     food   count  rate
0                  Banana  491291  True
1  Bag of Organic Bananas  394930  True
2    Organic Strawberries  275577  True
3    Organic Baby Spinach  251705  True
4    Organic Hass Avocado  220877  True

In [63]:
popular = val_df[val_df.rate == True]
popular.shape

(2053, 3)

In [0]:
top_25 = popular.head(25)

In [66]:
top_25

                          food   count  rate
0                       Banana  491291  True
1       Bag of Organic Bananas  394930  True
2         Organic Strawberries  275577  True
3         Organic Baby Spinach  251705  True
4         Organic Hass Avocado  220877  True
5              Organic Avocado  184224  True
6                  Large Lemon  160792  True
7                 Strawberries  149445  True
8                        Limes  146660  True
9           Organic Whole Milk  142813  True
10         Organic Raspberries  142603  True
11        Organic Yellow Onion  117716  True
12              Organic Garlic  113936  True
13            Organic Zucchini  109412  True
14         Organic Blueberries  105026  True
15              Cucumber Kirby   99728  True
16          Organic Fuji Apple   92889  True
17               Organic Lemon   91251  True
18      Organic Grape Tomatoes   88078  True
19    Apple Honeycrisp Organic   87272  True
20         Seedless Red Grapes   86748  True
21            Organic Cucumber   85005  True
22            Honeycrisp Apple   83320  True
23        Organic Baby Carrots   80493  True
24  Sparkling Water Grapefruit   79245  True

In [0]:
top_list = top_25.food.to_list()

In [68]:
top_list

['Banana',
 'Bag of Organic Bananas',
 'Organic Strawberries',
 'Organic Baby Spinach',
 'Organic Hass Avocado',
 'Organic Avocado',
 'Large Lemon',
 'Strawberries',
 'Limes',
 'Organic Whole Milk',
 'Organic Raspberries',
 'Organic Yellow Onion',
 'Organic Garlic',
 'Organic Zucchini',
 'Organic Blueberries',
 'Cucumber Kirby',
 'Organic Fuji Apple',
 'Organic Lemon',
 'Organic Grape Tomatoes',
 'Apple Honeycrisp Organic',
 'Seedless Red Grapes',
 'Organic Cucumber',
 'Honeycrisp Apple',
 'Organic Baby Carrots',
 'Sparkling Water Grapefruit']

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [69]:
##### YOUR CODE HERE #####
orders_all.head()

   product_id  ... days_since_prior_order
0           1  ...                    7.0
1         769  ...                    7.0
2        6184  ...                    7.0
3        8048  ...                    7.0
4        9007  ...                    7.0

[5 rows x 11 columns]

In [70]:
def time(li):
  if li >= 12.1:
    return(True)
  else:
    return(False)

orders_all['time'] = orders_all['order_hour_of_day'].apply(time)
orders_all.head()

   product_id                product_name  ...  days_since_prior_order   time
0           1  Chocolate Sandwich Cookies  ...                     7.0  False
1         769      Sliced American Cheese  ...                     7.0  False
2        6184                 Clementines  ...                     7.0  False
3        8048     Packaged Grape Tomatoes  ...                     7.0  False
4        9007              Frosted Flakes  ...                     7.0  False

[5 rows x 12 columns]

In [74]:
after_12 = orders_all[orders_all.time == True]
after_12.shape

(21899206, 12)

In [0]:
before_12 = orders_all[orders_all.time == False]

In [73]:
orders_all.order_hour_of_day.unique()

array([11, 14, 10, 15, 16, 18, 17, 22, 23, 12, 19,  5,  7, 20, 21, 13,  9,
        4,  0,  1,  8,  6,  2,  3])

In [0]:
after_12_li = after_12.product_name.value_counts()

In [77]:
after_12_li

Banana                                                                                                                313384
Bag of Organic Bananas                                                                                                252095
Organic Strawberries                                                                                                  178282
Organic Baby Spinach                                                                                                  164262
Organic Hass Avocado                                                                                                  144474
Organic Avocado                                                                                                       121529
Large Lemon                                                                                                           104517
Limes                                                                                                                  96661
Strawberries                                                                                                           94653
Organic Whole Milk                                                                                                     90764
Organic Raspberries                                                                                                    90421
Organic Yellow Onion                                                                                                   76988
Organic Garlic                                                                                                         75497
Organic Zucchini                                                                                                       71902
Organic Blueberries                                                                                                    67542
Cucumber Kirby                                                                                                         66140
Organic Lemon                                                                                                          59593
Organic Grape Tomatoes                                                                                                 58152
Organic Fuji Apple                                                                                                     57298
Organic Cucumber                                                                                                       55883
Apple Honeycrisp Organic                                                                                               55092
Seedless Red Grapes                                                                                                    54903
Honeycrisp Apple                                                                                                       52770
Organic Baby Carrots                                                                                                   51167
Yellow Onions                                                                                                          50864
Organic Baby Arugula                                                                                                   50230
Sparkling Water Grapefruit                                                                                             49778
Organic Large Extra Fancy Fuji Apple                                                                                   49653
Carrots                                                                                                                49038
Fresh Cauliflower                                                                                                      48044
                                                                                                                       ...
Imported Stout Draught Style                                                                                               1
Gluten Free Gold Lager                                                                                                     1
Tea House Organic Black Tea With Blackberry & Sage                                                                         1
Organic Baked Sour Cream & Onion Potato Chips                                                                              1
RefillReuse Bottle Blue                                                                                                    1
Smooth & Silky Head and Shoulders Smooth & Silky 2-in-1 Dandruff Shampoo + Conditioner 13.5 Fl Oz Female Hair Care         1
Extra Volume Dandruff Shampoo                                                                                              1
Cabernet Sauvignon 2015                                                                                                    1
Raspberry Blast Fruit and Chia Seed Bar                                                                                    1
Drink Distinct All Natural Soda Pineapple Coconut & Nutmeg                                                                 1
Flavored Fizzy Drink Mix 1000 mg Vitamin C Strawberry-Kiwi                                                                 1
Lindor Peppermint White Chocolate Truffles                                                                                 1
Grapefruit Mineral Water                                                                                                   1
Zero Drops Fruit Punch                                                                                                     1
Vanilla Bean Sheep Milk Ice Cream                                                                                          1
Royal Blend with Flaxseed                                                                                                  1
Pantene Pro-V Color Preserve Volume Conditioner                                                                            1
Great Lash Waterproof Mascara - Brownish Black 112                                                                         1
Dulse Organic Brown Rice Cakes                                                                                             1
Control GX Gray Reducing Shampoo                                                                                           1
Organic Gluten Free Chai Spice Cake Baking Mix                                                                             1
Fruit Me Up!  Applesauce Pouches                                                                                           1
Sweet Potato Fettuccine                                                                                                    1
Junior Water Berry Flavored                                                                                                1
Asian Ginseng Liquid Herbal Extract                                                                                        1
String Of Pearl White Sprinkles                                                                                            1
Sonic Care Simply Clean Standard Size Brush Heads                                                                          1
Sugar Leaf  Stevia and Raw Cane Sugar                                                                                      1
Urinary Health Extra Strength Liquid Cranberry                                                                             1
Ultra Sun Blossom Liquid 90 loads Fabric Enhancers                                                                         1
Name: product_name, Length: 49585, dtype: int64

In [0]:
popular_group = popular.groupby('')

In [78]:
popular.head()

                     food   count  rate
0                  Banana  491291  True
1  Bag of Organic Bananas  394930  True
2    Organic Strawberries  275577  True
3    Organic Baby Spinach  251705  True
4    Organic Hass Avocado  220877  True

In [79]:
orders_all.head()

   product_id                product_name  ...  days_since_prior_order   time
0           1  Chocolate Sandwich Cookies  ...                     7.0  False
1         769      Sliced American Cheese  ...                     7.0  False
2        6184                 Clementines  ...                     7.0  False
3        8048     Packaged Grape Tomatoes  ...                     7.0  False
4        9007              Frosted Flakes  ...                     7.0  False

[5 rows x 12 columns]

In [0]:
order_time = orders_all.groupby('product_name')['order_hour_of_day'].median()

In [89]:
order_time

product_name
#2 Coffee Filters                                                  13.0
#2 Cone White Coffee Filters                                       10.0
#2 Mechanical Pencils                                              10.0
#4 Natural Brown Coffee Filters                                    12.0
& Go! Hazelnut Spread + Pretzel Sticks                             13.0
'Swingtop' Premium Lager                                           19.0
(70% Juice!) Mountain Raspberry Juice Squeeze                      11.0
+Energy Black Cherry Vegetable & Fruit Juice                       12.0
.5\" Waterproof Tape                                                9.5
0 Calorie Acai Raspberry Water Beverage                            14.0
0 Calorie Fuji Apple Pear Water Beverage                           13.0
0 Calorie Strawberry Dragonfruit Water Beverage                    13.0
0% Fat Black Cherry Greek Yogurt y                                 12.0
0% Fat Blueberry Greek Yogurt                                      13.0
0% Fat Free Organic Milk                                           13.0
0% Fat Greek Yogurt Black Cherry on the Bottom                     14.0
0% Fat Greek Yogurt Vanilla                                        11.0
0% Fat Organic Greek Vanilla Yogurt                                13.0
0% Fat Peach Greek Yogurt                                          13.0
0% Fat Strawberry Greek Yogurt                                     14.0
0% Fat Superfruits Greek Yogurt                                    13.0
0% Fat Vanilla Greek Yogurt                                        12.0
0% Greek Strained Yogurt                                           12.0
0% Greek Yogurt Black Cherry on the Bottom                         13.0
0% Greek, Blueberry on the Bottom Yogurt                           13.0
0% Milkfat Greek Plain Yogurt                                      11.0
0% Milkfat Greek Yogurt Honey                                      14.0
007 Vodka With Martini Glasses                                     14.0
1 % Lowfat Milk                                                    14.0
1 Apple + 1 Mango Fruit Bar                                        13.0
                                                                   ...
of Norwich Original English Mustard Powder Double Superfine        13.0
pumpkin spice                                                      13.0
rich kiss Olive & Aloe Moisturizer 2 in 1                          13.5
smart Blend Chicken & Rice Formula Dry Dog Food                    13.0
smartwater® Electrolyte Enhanced Water                             13.0
vitaminwater® XXX Acai Blueberry Pomegranate                       13.0
w/Banana Pulp Free Juice                                           14.0
with Bleach Disinfectant Cleanser Scratch Free Lavender Fresh      13.0
with Bleach Powder Cleanser                                        13.0
with Color Safe Brightener Power Paks 2in1 Stain Fighter           12.0
with Crispy Almonds Cereal                                         12.0
with Dawn Action Pacs Fresh Scent Dishwasher Detergent Pacs        13.0
with Lime Juice Mayonesa Mayonnaise                                12.0
with Mac & Cheese Fish Sticks                                      14.0
with Olive Oil Mayonnaise                                          14.0
with Olive Oil Mayonnaise Dressing                                 14.0
with Pump Rebalancing Shampoo                                      13.0
with Seasoned Roasted Potatoes Scrambled Eggs & Sausage            13.0
with Sweet & Smoky BBQ Sauce Cheeseburger Sliders                  15.0
with Sweet Cinnamon Bunches Cereal                                 12.5
with Twist Ties Sandwich & Storage Bags                            13.5
with Xylitol Cinnamon 18 Sticks Sugar Free Gum                     12.0
with Xylitol Island Berry Lime 18 Sticks Sugar Free Gum            12.0
with Xylitol Minty Sweet Twist 18 Sticks Sugar Free Gum            13.0
with Xylitol Original Flavor 18 Sticks Sugar Free Gum              13.0
with Xylitol Unwrapped Original Flavor 50 Sticks Sugar Free Gum    13.0
with Xylitol Unwrapped Spearmint 50 Sticks Sugar Free Gum          14.0
with Xylitol Watermelon Twist 18 Sticks Sugar Free Gum             13.0
with a Splash of Mango Coconut Water                               12.0
with a Splash of Pineapple Coconut Water                           13.0
Name: order_hour_of_day, Length: 49685, dtype: float64

In [0]:
order_time = pd.DataFrame(order_time)

In [91]:
order_time.reset_index(inplace=True)
order_time.head()

                             product_name  order_hour_of_day
0                       #2 Coffee Filters               13.0
1            #2 Cone White Coffee Filters               10.0
2                   #2 Mechanical Pencils               10.0
3         #4 Natural Brown Coffee Filters               12.0
4  & Go! Hazelnut Spread + Pretzel Sticks               13.0

In [0]:
def ordert(li):
  if li in popular.food.to_list():
    return(1)
  else:
    return(0)

order_time['pop'] = order_time.product_name.apply(ordert)

In [109]:
order_time.head()

                             product_name  order_hour_of_day  pop
0                       #2 Coffee Filters               13.0    0
1            #2 Cone White Coffee Filters               10.0    0
2                   #2 Mechanical Pencils               10.0    0
3         #4 Natural Brown Coffee Filters               12.0    0
4  & Go! Hazelnut Spread + Pretzel Sticks               13.0    0

In [0]:
order_time_pop = order_time[order_time['pop'] == 1]

In [112]:
order_time_pop.shape

(2053, 3)